In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
demo1 = pd.read_csv('api_data_aadhar_demographic_0_500000.csv')
demo2 = pd.read_csv('api_data_aadhar_demographic_500000_1000000.csv')
demo3 = pd.read_csv('api_data_aadhar_demographic_1000000_1500000.csv')
demo4 = pd.read_csv('api_data_aadhar_demographic_1500000_2000000.csv')
demo5 = pd.read_csv('api_data_aadhar_demographic_2000000_2071700.csv')

In [3]:
demo_combined = pd.concat([demo1,demo2,demo3,demo4,demo5], ignore_index = True)

In [4]:
df = demo_combined.copy()

In [5]:
df.shape

(2071700, 6)

In [6]:
df.head(4)

,date,state,district,pincode,demo_age_5_17,demo_age_17_
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375
2,01-03-2025,Gujarat,Rajkot,360006,65,765
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314

In [7]:
df.isnull().sum()

date             0
state            0
district         0
pincode          0
demo_age_5_17    0
demo_age_17_     0
dtype: int64

In [8]:
df.describe()

            pincode  demo_age_5_17  demo_age_17_
count  2.071700e+06   2.071700e+06  2.071700e+06
mean   5.278318e+05   2.347552e+00  2.144701e+01
std    1.972933e+05   1.490355e+01  1.252498e+02
min    1.000000e+05   0.000000e+00  0.000000e+00
25%    3.964690e+05   0.000000e+00  2.000000e+00
50%    5.243220e+05   1.000000e+00  6.000000e+00
75%    6.955070e+05   2.000000e+00  1.500000e+01
max    8.554560e+05   2.690000e+03  1.616600e+04

In [9]:
df.dtypes

date             object
state            object
district         object
pincode           int64
demo_age_5_17     int64
demo_age_17_      int64
dtype: object

In [14]:
df.rename(columns = {
    'demo_age_17_' : 'age_17_plus_count',
    'demo_age_5_17' : 'age_5_17_count'
}, inplace = True)

In [15]:
df.columns.tolist()

['date', 'state', 'district', 'pincode', 'age_5_17_count', 'age_17_plus_count']

In [16]:
df['date'] = pd.to_datetime(df['date'], dayfirst = True, errors = 'coerce')

In [17]:
df['date'].isna().sum()

np.int64(0)

In [18]:
df.dtypes
# df['date'].min(), df['date'].max()

date                 datetime64[ns]
state                        object
district                     object
pincode                       int64
age_5_17_count                int64
age_17_plus_count             int64
dtype: object

In [19]:
df['pincode'] = df['pincode'].astype(str)

In [20]:
df['state'] = df['state'].str.strip().str.lower()
df['district'] = df['district'].str.strip().str.lower()

In [38]:
df.head(3)

,date,state,district,pincode,age_5_17_count,age_17_plus_count
0,2025-03-01,uttar pradesh,gorakhpur,273213,49,529
1,2025-03-01,andhra pradesh,chittoor,517132,22,375
2,2025-03-01,gujarat,rajkot,360006,65,765

In [25]:
df.duplicated().sum()

np.int64(0)

In [22]:
df[df.duplicated()].head()

,date,state,district,pincode,age_5_17_count,age_17_plus_count
182369,2025-12-06,odisha,jajpur,755020,0,1
219406,2025-11-10,west bengal,south 24 parganas,743368,0,1
227394,2025-10-26,tamil nadu,krishnagiri,635207,6,17
227395,2025-10-26,tamil nadu,krishnagiri,635306,6,3
227396,2025-10-26,tamil nadu,krishnagiri,635307,5,17

In [24]:
df = df.drop_duplicates().reset_index(drop = True)